package XML;

/**
 * XML是可扩展标记语言的缩写，它是一种数据表示格式，可以描述非常复杂的数据结构，常用于传输和存储数据，可以用于自定义数据格式
 * 使用场景：XML内容经常被当成消息进行网络传输，或者作为配置文件用于存储系统的信息
 * 作用：用于进行存储数据和传输数据，作为软件的配置文件
 * 文档声明必须是第一行
 * <?xml version="1.0" encoding="UTF-8"?>
 * version：XML默认的版本号码、该属性是必须存在的
 * encoding：本XML文件的编码
 * 标签（元素）规则
 * 标签由一对尖括号和合法标识符组成：<name></name>，必须存在一个根标签，有且只能有一个
 * 标签必须成对出现，有开始，有结束<name></name>
 * 特殊的标签可以不成对，但是必须有结束标记，如<br/>
 * 标签中可以定义属性，属性和标签名空格隔开，属性值必须用引号引起来<student id="1"></student>
 * 标签需要正确的嵌套
 * &lt < 小于  &gt > 大于   &amp & 和号  &apos ' 单引号 &quot " 引号
 */
public class text1 {
}












